src/cf/Documents/ФормированиеЗаписейКУДиР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ФормированиеЗаписейКУДиР</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийАвтор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПокупки</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПокупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПринятыхРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНеПринятыхРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНеПринимаетсяУСН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОППокупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОПОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусыОплатыРасходовПокупки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыРасходовУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусыОплатыРасходовОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыРасходовУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСписания</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОПСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусыОплатыРасходовСписания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыРасходовУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПокупкиНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНеПринимаетсяУСН_НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПринятыхРасходовНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНеПринятыхРасходовНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПринимаетсяУСН_Покупки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПринимаетсяУСН_Оплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПринимаетсяУСН_Списание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УменьшениеНалога</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПФР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФСС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФОМС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФСС_НС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Больничные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобровольноеСтрахование</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ФормированиеЗаписейКУДиР/Ext/ObjectModule.bsl
Процедура ДвиженияПоРегистрам(Отказ)
	//Движения регистра "Книга учета доходов и расходов (раздел I)"
	тзДвиженияКУДиР=Движения.КнигаУчетаДоходовИРасходов.Выгрузить();
	тзДвиженияРасходыПриУСН=Движения.РасходыПриУСН.Выгрузить();
	Для Каждого СтрокаКоллекции ИЗ Расшифровка Цикл
		Если СтрокаКоллекции.СуммаПринятыхРасходов<>0 ИЛИ СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда 
			Если (СтрокаКоллекции.СтатусыОплатыРасходовОплаты=СтрокаКоллекции.СтатусыОплатыРасходовПокупки) И
				(СтрокаКоллекции.ДокументОплаты=СтрокаКоллекции.ДокументПокупки) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда /// Тогда достаточно одной строки
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
			ИначеЕсли (СтрокаКоллекции.СтатусыОплатыРасходовОплаты=СтрокаКоллекции.СтатусыОплатыРасходовПокупки) И
				(СтрокаКоллекции.ДокументОплаты=СтрокаКоллекции.ДокументПокупки) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда /// Тогда достаточно одной строки
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"ДоговорКонтрагента");
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументСписания;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовСписания;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОПСписания;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Списание;
				
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
			Иначе	/// Иначе несколько строк
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				Если НЕ ТипЗнч(СтрокаКоллекции.ДокументОплаты)=тип("ДокументСсылка.АвансовыйОтчет") И НЕ ТипЗнч(СтрокаКоллекции.ДокументОплаты)=тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"Номенклатура");
				Иначе
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				КонецЕсли;
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументОплаты;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовОплаты;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОПОплаты;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Оплата;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	

				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда
					НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"ДоговорКонтрагента");
					НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументСписания;
					НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовСписания;
					НоваяСтрока.ТОП=СтрокаКоллекции.ТОПСписания;
					НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Списание;
					
					Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
						НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
						НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
					Иначе
						НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
						НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;		
		
		Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда Продолжить; КонецЕсли; 
		Если СтрокаКоллекции.СуммаПринятыхРасходов=0 Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока=тзДвиженияКУДиР.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
		
		НоваяСтрока.Графа7=СтрокаКоллекции.СуммаПринятыхРасходов;
		НоваяСтрока.НДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
		
		НоваяСтрока.Содержание=СтрокаКоллекции.Содержание;
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда
			Если НачалоДня(СтрокаКоллекции.ДокументОплаты.Дата)<НачалоДня(СтрокаКоллекции.ДокументСписания.Дата)  Тогда
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументСписания.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументСписания.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументСписания.Дата);
			Иначе
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			Если НачалоДня(СтрокаКоллекции.ДокументОплаты.Дата)<НачалоДня(СтрокаКоллекции.ДокументПокупки.Дата) Тогда
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументПокупки.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Дата);
			Иначе
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
			НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=СтрокаКоллекции.ДокументПокупки.Дата;
			НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Дата);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=Дата;
			НоваяСтрока.Графа2="№     от "+СокрЛП(Дата);
		КонецЕсли;		
	КонецЦикла;	
	
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Организация, "Организация");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Истина, "Активность");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Дата, "Период");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	тзДвиженияКУДиР.ЗаполнитьЗначения(Организация, "Организация");
	тзДвиженияКУДиР.ЗаполнитьЗначения(Истина, "Активность");
	тзДвиженияКУДиР.ЗаполнитьЗначения(Дата, "Период");
	
	
	Движения.КнигаУчетаДоходовИРасходов.Загрузить(тзДвиженияКУДиР);
	Движения.РасходыПриУСН.Загрузить(тзДвиженияРасходыПриУСН);
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли; 
	
	ДвиженияПоРегистрам(Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства);
